import React from "react";
import Pagination from "./Pagination";
import HomeSinglePost from "./HomeSinglePost";

const HomePosts = () => {
  return (
    /**************** >>>> HomePosts start <<<< *****************/
    <div className="posts-sec">
      <div className="posts-parent-div">
        <div className="section-title">جدیدترین مطالب</div>
        <div className="posts-div">
          <HomeSinglePost
            singlePostBgImage="https://uploads-ssl.webflow.com/5ff542e0e6322e20ee9571b4/5ff98963e1772678231645c9_Rectangle%2094.jpg"
            title="موشکافی داستان فیلم Tenet کریستوفر نولان"
            desc="به ‌دنبال ظهور واریانت جدید ویروس کرونا در بریتانیا که پروتئین اسپایک
          آن جهش پیدا کرده است، نگرانی‌هایی در مورد ایجاد مقاومت در برابر واکسن
          کووید ۱۹ ایجاد شده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
          <HomeSinglePost
            title="هلدینگ فناوری بانک کارآفرین به‌دنبال موفقیت با نگاهی کسب ‌و
            کارانه است در این شرایط که همه چی در حال افول میباشد"
            desc="نتفلیکس به‌منظور بازاریابی برای فیلم‌ها و سریال‌های اختصاصی‌اش و
            پیش‌بینی تعداد بینندگان آن‌ها بر هوش مصنوعی اتکا می‌کند. این
            شرکت اخیرا نحوه‌ی استفاده از AI را شرح داده است..."
            authorDate="پویان عسگرپور | ۱۰ دی ۹۹، ۱۲:۳۶"
          />
        </div>

        <Pagination />
      </div>
    </div>
    /**************** >>>> HomeGrid end <<<< *****************/
  );
};

export default HomePosts;
